{
  "blogs": [
    {
      "title": "My First Blog Post (on my own blog)",
      "time": "Feb 1, 2015. 5:25 PM",
      "body": "So this was purely experimental and all for practice. I wasn't sure how to do this but I knew that I really wanted to make my own blog and I figured out how.<br><br>The way I did this feels a big \"hacky,\" but this was the only way I could figure out how without building a node server, or any sort of server, which would've been an a bigger endeavour than I can take on right now. I will eventually."
    },
    {
      "title": "Coding - 4 Month Impression",
      "time": "Feb 5, 2015. 5:00 PM",
      "body": "So I have been learning how to code for a little over 4 months now. The journey has been long, arduous, surprising, frustrating, satisfying, infuriating, exciting, aggravating, and inspiring. Yeah, I've had many ups and downs throughout this journey. The downs are pretty crappy but the ups are awesome! Despite the nauseating rollercoaster I am still very much anxious about the future, and hopeful of what it brings.<br><br>  I by no means espected any of this to be easy... however know that doesn't make the hard stuff any easier to bare as I hoped it would. I WISH it was easier but then that would be too easy. And so I press on.<br>  I have actually surprised myself a lot with the things that I could actually do, the things that I figured out, things I was able to learn, etc. For example, this blog. I made this work somehow and it wasn't as frustrating as I thought it would be. Granted, it's not the best way to create a blog, hell I'm not even sure that I would tell anybody to make a blog the way I did. But, hey, it's here. I made it. The most important thing, I think, from what I've been told, is that I'm creating things. I'm constantly trying to think of things that I could try on my website, so long as it makes sense being on my website, of course.<br><br>  That's all for now! Stay tuned to my life by following me on <a href='http://twitter.com/piecedigital'>Twitter</a> and reading any new blogs that I post :)"
    },
    {
      "title": "How I Made My Blog",
      "time": "Feb 9, 2015. 4:13 AM",
      "body": "So, a co-volunteer buddy of mine suggested that I should write a blog talking how I made this blog. Before I proceed, though, I'd just like to note that I am far from professional and far from knowing everything, so if you notice an alternative method to anything I did don't hesitate to leave feedback! Also, this is not a tutorial but rather an overview of how I created it, and the thought process from conception to creation.<br> Alright, now let's continue! <br><br> <span class='h3'>Conception</span> I had this seemingly crazy idea that I would be able to create a blog that would post any content that I put into a single file, and for several files. Or, I could create a server and build a blog off of that... but I can't create a server, I don't know how... yet. But I wanted a blog to use so I needed to figure out an alternative way of creating one. <br><br> <span class='h3'>Version 1</span> I initially thought that I had to create a script that would read files and print all of the data inside of them. But that became no better than creating new HTML files over and over again because I still needed to put the data into the correct divs and headers, and the way I had the script I still needed to edit the JS file a bit so that it would read all of the files in a folder. At the end of this version I knew I needed to revisit it and refactor it. <br><br> <span class='img-sourced'><img src='https://s-media-cache-ak0.pinimg.com/236x/6a/bb/b0/6abbb04a80ebc210220a76bcc5dae99d.jpg'><br> <a href='https://www.pinterest.com/brucetea/bruce-lee-quotes/'>Source: Pinterest, Bruce Lee Quotes</a></span> <br><br> <span class='h3'>Version 2</span> My goal was to create a blog where all I needed to do to add new blog post was edit a few things in a single file and it would automatically get listed along with my other blog posts. This ultimately turned out to be the successful version of my blog and the one I am using now. <br><br> <span class='h3'>How I Made It</span> It's all Javascript! Ok, so it's gonna be a little hard to explain but bear with me. <br><br> The first thing you see when you go on my blog is the list of every available blog post, along with the blog title that is a link, time for that blog, and a sample of the blog post before it gives another link to the post, for convenience. <br><br> Where does it gather that information? Another JS file! A JS file with an array of objects. Those objects contain the title, time, and body property for each blog post. <br><br> Now I have only one file that I need to change in order to create new blog posts. I now needed a way of listing them on my blog homepage. The script I ended up creating performs several task: &bull; First and foremost, it lists every available blog. Not just by number but it also lists the title, time, and a sample of the body of the blog post.<br> &bull; Next, it places each of those details in appropriate HTML objects. This and the the task in the first point are occurring simultaneously. To achieve I had to include HTML tags in the script surrounding the blog values.<br> &bull; Lastly, for scaling, I created and tested several variables to list only a certain number of the blog posts at one time(currently set at 5), and then 2 functions to enable navigation through each of the blog posts. This took quite some time to achieve. I had to figure out how I was to maintain this format while not allowing the ever changing number of the navigation variable to break it. It took me hours of debugging but I finally got it to perform as I wanted it to. <br><br> <span class='img-sourced'><img src='http://www.clicktrue.biz/wp-content/uploads/victory-baby.jpg'><br> <a href='http://www.clicktrue.biz/culture/follow-your-passion/attachment/victory-baby'>Source: clicktrue</a></span> <br><br> So that's pretty much it! That is the foundation of how I display each blog post on the blog homepage. For the posting of each blog post in full, I created another HTML doc and a JS file that posted the full information of each blog, like the first JS file does. The only difference is that it posts the full body, not just a sample, and it doesn’t show a list of each blog. In addition to posting the full blog this new script adds a Twitter and Facebook share button, and a disqus thread. It makes the script a bit bulkier but it's simply placing the appropriate HTML objects in the DOM as needed for the Disqus thread to work, as well as for the Twitter and Facebook sharing buttons. In addition, the script also changes the title of the page to include the blog title. <br><br> And there you have it an auto-generated blog where all I have to do is add a new blog post! I will most likely continue to update the blog code. In fact as I was finishing up this blog I had to make some changes to the format. Ah, coding. It never ends... good! Hopefully this was a clear enough read for you. If not, feel free to leave a comment below and I'll explain anything that didn’t make sense to you better, maybe even update the blog itself. Thanks for reading! :)"
    },
    {
      "title": "First Coding Live Stream",
      "time": "Feb 13, 2015. 12:30 AM",
      "body": "So this was the first time I had livestreamed myself coding at it was pretty successful! Thanks for the shoutouts of a few that did, namely Jason at <a href='http://freecodecamp.com'>FreeCodeCamp.com</a> and Travis over at <a href='http://twitter.com/gamer_gfx'>@Gamer_GFX</a>. For convenience sake I'll embed the video here!<br><br> <iframe width='560' height='315' src='https://www.youtube.com/embed/9WGMx-un0eU' frameborder='0' style='display: block; margin: 0 auto;' allowfullscreen></iframe><br><br> I decided that I really needed to practice coding more to keep my front end skills sharp, so when I saw Travis post this mock up I knew I had to jump on it. I also decided that I should take a stab at livestreaming it, maybe something would come of it. I got more out of it that I thought!<br><br> Enjoy! :)"
    },
    {
      "title": "Venting",
      "time": "Feb 26, 2015. 2:15 AM",
      "body": "Sometime I wonder if life is hard or if I’m just making it hard for myself… no, life is definitely hard. There is a chance, however, that I make it harder for myself. Maybe it’s because my goals are too high, although I find wanting to eat 3 meals a day without worrying about how much I eat to not be a  very high goal at all; I find it necessary. So many needs, so many wants, so many things money requires, so many things money can fix. Money is… damn near everything. <br><br> I’m fearful that I wont be able to accomplish my goals or do anything meaningful with my life. I’m trying my hardest not to let that be a thing. I feel as though I’m this close to something major. I can’t be too far off, can I? I mean, look at what I’ve done: building my fourth website from scratch AGAIN in the span of 5 months, all of which I designed and planned on my own. I’ve designed several different logos, a couple of them are actually for people, and I’m self-taught in graphic design. I’ll be DAMNED if I get nowhere with what I can do! <br><br> <span class='img-sourced'><img src='../images/logos/gom-3.png'><br> <a href='../portfolio_logos'>Source: My Portfolio</a></span> <br><br> Alas, doubt creeps in and I feel as though none of that matters. Doesn’t matter if you haven’t been doing it all your life. I’m in this terrible position where I’m a late bloomer. I started to find myself very late in my life. A lot of things happened late in my life, and a lot of things will probably continue to happen later. I’m ok with that just as long as it’s a positive thing and it happens. <br><br> Alright, so enough emotions. What have I been doing? Welp, I’ve been <a href='https://www.behance.net/wip/1001935' target=’_black’>designing a new logo</a>, <a href='https://www.behance.net/wip/1001931' target=’_black’>redesigning the 2nd website I ever built</a> and designing the logo for that site. Besides that I’ve just been trying to complete challenges over at <a href='http://freecodecamp.com/' target=’_black’>Free Code Camp</a>. It’s about time that I got on a non-profit project. Hope it’s soon. <br><br> May the best of your todays be the best of your tomorrows. :) . "
    },
    {
      "title": "VICTORY!  My First Node Server",
      "time": "Mar 2, 2015. 6:40 AM",
      "body": "Today I'm pretty happy. I feel very successfull, accomplished, like I really did something... today I had a small victory: I successfully initiated a NodeJS server with Socket.io! <br><br> <span class='img-sourced'><img src='https://danceswithfat.files.wordpress.com/2011/08/victory.jpg'><br> <a href='http://www.fox.com/family-guy'>Source: Family Guy</a></span> <br><br> It a great feeling accomplishing something, even if it is tiny compared to what other do. Normally I wouldn’t allow myself to get excited for something small compared to, say, <a href='http://en.wikipedia.org/wiki/Steve_Wozniak'>Steve Wozniak</a>… but f*ck it, I’m excited! <br><br> <span class='img-sourced'><img src='http://i.gyazo.com/0206859aab87e09974458d53e8c9bc68.png'><br> <a href='#'>Source: Screenshot </a></span> <br><br> It’s still a work in progress. It’s nearly ready to go live in a beta state, and there will still be much added to it like a database of usernames. I’ll keep you posted :)."
    },
    {
      "title": "I'VE BEEN ATTACKED!",
      "time": "Mar 7, 2015. 6:20 AM",
      "body": "Recently I was the \"victim\" of XSS (Cross-Site Scripting) on a chat server that I, and a few others over at Free Code Camp, are building. The attacks were fortunately not malicious; they were carried out by a fellow code camper! :) <br><br> Why would I be smiling? Because thanks to them I was able to plug up many vulnerabilities on our chat app. I spent the remainder of that day and the next plugging different issues on our server and adding new features like user name validation. It was good for me to get some experience with dealing with server vulnerablility issues. <br> I also gained the feeling of being a server admin, which feels pretty damn cool! One thing I never thought I’d be able to achieve was the ability to build a server, let alone manage one after watching a tutorial. I still have a greater interest in front end development but now at least I'm not as afraid of back end as I once was... well, for NodeJS anyways. :) <br><br> Here's to more experience to get me job ready. Woo hoo! "
    },
    {
      "title": "What I've been up to - 3/22",
      "time": "Mar 22, 2015. 3:10 PM",
      "body": "So I’ve been hard at work on <a href='http://free-code-chat.herokuapp.com'>Free Code Chat</a>. It’s coming along very well and I’m really happy with the progress that I’ve made on the site. I recently added new updates including, but not limited to:<br><br>&bull; New global commands<br>&bull; The ability to make and join different rooms<br>&bull; Replacing the homepage with a landing page where you can enter your desired chat room, or visit a recent room<br><br>I’m hoping that what I’ve built here will be useful to Free Code Camp in some way, but until then this is just a really good project to reference in a job interview. Hey, I built a server on my own. I’m pretty happy with that :)<br><br>Stay tuned!"
    },
    {
      "title": "Getting My Flow Down",
      "time": "Apr 19, 2015. 1:15 AM",
      "body": "So I think I may be getting a nice coding flow. I used to just code all day and try to hammer out as much code as I can, but I realize now that that wasn’t very effective. Recently I’ve discovered that if I only code for about 6-8 hours a day, with a nice break in between, that I actually get more done. My brain isn’t completely fried by problem solving, I’m not frustrated by getting nowhere, and, most importantly, I’m enjoying it like I used to!<br><br>I took a bit of a dip in my progress. I was getting discouraged because I still don’t feel as though I’m qualified for a job (even though I probably am but my confidence is shot). It’s only been 6.5 months so maybe I’m a little impatient… then again <a href='http://www.learnwithjeff.com/blog/2012/08/21/how-to-get-a-job-as-a-developer-in-less-than-six-months/' target='_blank'>this guy only coded for 6 months</a> and got a job, so why should that stop me? I’ll be damned if I can’t find anything, after all of the effort I’ve put into learning how to code.<br><br> Anyway, I’m glad I have my mojo back, and I got a good flow going. I’m currently in the process of answering these questions for the <a href='http://www.ign.com/articles/2015/04/02/apply-to-igns-2015-code-foo-internship-program-today'>Code Foo 2015</a> that IGN is having. I’m nearly done, all I have to do, at the time of me writing this, is design the front page for a website that’s displaying data pulled from their API, and then make a video stating why I want this internship.<br><br> \"'Cause I wanna make money. Duh.\"<br><br> Yeah, not gonna work. I’ll definitely think of something more meaningful (and truthful). I was told that I needed to find a niche. I love playing video game, ergo I believe that this would be an awesome fit for me! A gamer among gamers. That’s the dream. Yeah, the dream…<br><br> Alrighty, I am done coding for the day. Time to chill and think about coding tomorrow. Peace!"
    },
    {
      "title": "Project Ajax",
      "time": "May 16, 2015. 9:00 PM",
      "body": "So I’ve spent the last 4 weeks building my website. It might’ve taken me only 2-3 if it was all I did but I was busy with other things, so it was an on-and-off thing. I’ve finally reached the point where I’m ready to push it to my live site, so if you’re seeing this blog post my site is finally live!<br><br>I wouldn’t call it perfect but I think it’s pretty damn close to what I want it. it’s doing what I want, even if it’s not what doing it the way I wanted it to initially. However I’d rather have something that works in a way than nothing that’s nowhere but in my soul (and my hard drive) as I try to perfect it. From what I can tell that’s not how professionals do web development. I think we all realize that “perfection is not attainable, but if we chase perfection we can catch excellence.” (Vince Lombardi).<br><br>I think this is a good motto to live by. If heeded well enough it can prevent stress for minor or even major issues. It can prevent anger at oneself or another for making an error, and instead re-focusing on figuring out how to fix the issue. It can prevent feeling defeat, and subsequent sadness, for not getting something right the first time.<br><br>Failure is normal. Failure is ok. Failure can lead to growth. Embrace failure.<br><br>That said, my website will be an on-going project. I’ll always be improving it in some way, kind of like myself. I’m like an on-going project and I’m trying to fix my issues, add new features, and perfect the features that I do have.<br>If you think about it, the internet is simply life digitized.<br><br>Now that my website is live I think it’s time for a new project. I’ll probably try to learn React. I’m pretty sure that’s what I’m going to work with. Since React is merely the V in MVC it might be easier to learn. The principles still apply to other frameworks, I think. I’ve pretty much done the same thing on my website without a framework so I’m not totally new to the concept of Ajax (hence the name of my website rebuild being called “Project Ajax”).<br><br>Alright, back to life we go. Godspeed! :)"
    },
    {
      "title": "What I've been up to - 6/18",
      "time": "Jun 18, 2015. 1:00 AM",
      "body": "So it has been quite a while since my last blog post. I haven’t anything interesting to talk about until recently, which is me learning Angularjs!<br><br>tl:dr, it’s aight but I couldn’t care less.<br><br>As an aspiring MEAN stack web developer I know that I need to learn Angular, or some other front-end framework. Up till now I’ve done everything I ever needed with just JavaScript/jQuery, and I’ve been very much ok with programming my own logic. But I know that skill wont take me very far considering the fact that I need to work with other people on projects and writing your own logic takes a while. Ehh, ok, so that’s why I’m learning Angularjs.<br><br>The process has been lackluster thus far. Here are the reasons why:<ol><li>It’s a bitch to debug. It doesn’t log any proper errors to the console so unless you’re experienced you have to proceed very slowly when adding things in and test frequently. Too frequently, I think</li><li>It’s a bit over complicated for what I think a framework is actually meant to do. It removes some issues that developers didn’t want to deal with, but then it creates other issues.</li><li>Knowing or having an idea of what it’s doing under the hood. There’s just something discomforting about it parsing the HTML to do dynamic things, things I’d rather do simply by targeting my HTML properly</li></ol><br><br>Regardless, I will become familiar enough with Angularjs so that I may be more employable. I still don’t like it, though. I’ve made my first little app using it. You can view it <a href=http://piecedigital.github.io/projects/youtube-video-viewer>here.</a><br><br><br>What’s next? Oh, other projects! I’m currently in the process of building a Nodejs server template. I may or may not make it public… probably not because I want to sell my services with it LOL. But it’s still a good project to work so I’ll at least talk about it and show off it’s functionality when I’ve finally got it to a useable state. I plan on trying some new things out with it, so I really look forward to this project.<br><br>What have you been working on? I’d like to know! Leave a comment below and I’ll be able to read it.<br><br>That’s all for now. Stay cool. Godspeed :)"
    }
  ]
}